extension/test/resources/payment-no-method.json

{
  "interfaceId": "pspReference",
  "amountPlanned": {
    "type": "centPrecision",
    "currencyCode": "EUR",
    "centAmount": 595,
    "fractionDigits": 2
  },
  "paymentMethodInfo": {
    "paymentInterface": "ctp-adyen-integration"
  },
  "custom": {
    "type": {
      "typeId": "type",
      "key": "ctp-adyen-integration-credit-card"
    },
    "fields": {
      "countryCode": "DE"
    }
  },
  "paymentStatus": {},
  "transactions": [
  ],
  "interfaceInteractions": [
  ]
}